import React from 'react'
import style from './term-use.module.css'
export default function page() {
  return (
    <>
        <div className={style.container}>
            <p>ข้อตกลงและเงื่อนไข</p>
            <br />
            <p>1. คำอธิบาย เงื่อนไข และข้อจำกัดในการบริการ

บริษัท มหาจักรดีเวลอปเมนท์ จำกัด ( ต่อไปนี้ เรียกว่า "บริษัท" ) สงวนสิทธิ์ให้บริการสั่งซื้อสินค้าทางเว็บไซต์ และจัดส่งสินค้านี้ ( ต่อไปนี้เรียกว่า "บริการ" ) ให้กับลูกค้่าที่เป็นบุคคลธรรมดาและเพื่อการใช้ในครัวเรือนเท่านั้น  บริษัทขอสงวนสิทธิ์ไม่ให้บริการแก่นิติบุคคลและผู้ประกอบการ การให้บริการนี้ มีพื้นที่จำกัด และบริษัทมีสิทธิ์ปฏิเสธ การให้บริการแก่ลูกค้าที่อยู่นอกพื้นที่บริการ ในการใช้บธิการนี้ ท่านจะต้องมีอายุไม่ต่ำกว่า 20 ปี และยอมรับข้อตกลงเงื่อนไขนี้ ตลอดจนข้อกำหนดและเงื่อนไขเกี่ยวกับเกี่ยวกับการสั่งซื้อสินค้าทางเว็บไซต์ และอนุญาตให้บริษัท ดำเนินการจัดการข้อมูลของท่านได้ โดยท่านจะต้องลงทะเบียนก่อนการ์ใช้บริการ

โปรดทราบว่าการใช้บิการนี้มีการเรียกเก็บค่าใช้จ่าย ราคาสินค้าที่ระบุในหน้าเว็บไซต์เป็นราคาโดยประมาณเท่านั้น โดยบริษัทจะเสนอราคาที่แน่นอน ในใบเสร็จรับเงิน / เอกสารการซื้อขายในวันที่บริษัทจัดส่งสินค้าให้แก่ท่าน ณ ที่อยู่ที่ท่านได้แจ้งต่่อบริษัท สัญญาระหว่างท่านและบริษัทในการซื้อสินค้าจะเกิดขึ้นต่อเมื่อท่านได้ตกลงยอมรับในราคาสินค้าที่แน่นอนดังกล่าว ทั้งนี้ จำนวนสินค้าที่มีจำหน่ายจะขึ้นอยู่กับจำนวนสินค้าที่บริษัทมีอยู่ ซึ่งบริษัทไม่สามารถรับประกันได้ว่าจะมีสินค้าตามรายการและรายละเอียดที่ได้แสดงไว้ในหน้าเว็บไซต์ การสั่งซื้อสินค้าผ่านบริการของบริษัทนี้ ให้เป็นไปตามข้อกำหนดและเงื่อนไขการสั่งซื้อสินค้าทางเว็บไซต์ซึ่งได้ระบุไว้ต่อไปในเว็บไซต์นี้ ในกรณีที่ท่านยกเลิกคำสั่งซื้อตามข้อตกลงและเงื่อนไขนี้ และข้อกำหนดและเงื่อนไขการสั่งซื้อสินค้าทางเว็บไซต์ บริษัทจะยกเลิกการกันวงเงินดังกล่าวภายในระยะเวลา 10-15 วันทำการ หรือตามเงื่อนไขที่ธนาคารกำหนด ก่อนใช้บริการนี้ ขอให้ท่านตรวจสอบว่าบัตรชำระเงินของท่านยังสามารถใช้ชำระค่าสินค้าทางเว็บไซต์ได้และบัตรดังกล่าวไม่สิ้นอายุก่อนวันที่คาดว่าจะมีการส่งสินค้าที่สั่งซื้อ หากบัตรชำระเงินของท่านสิ้นอายุในวันที่ส่งสินค้า บริษัทสงวนสิทธิยกเลิกการจัดส่งสินค้าให้แก่ท่านโดยไม่ต้องได้รับความยินยอมจากท่านหรือแจ้งให้ท่านทราบล่วงหน้า</p>
            <br />
            <p>2. การแก้ไขข้อตกลงและเงื่อนไขของบริษัท</p>
            <p>บริษัทขอสงวนสิทธิในการแก้ไขข้อตกลงและเงื่อนไขนี้ ณ เวลาใดๆ ก็ได้ ทั้งนี้ ให้ข้อตกลงและเงื่อนไขนี้มีผลบังคับใช้เมื่อมีการลงไว้ใน</p>
            <p>เว็บไซต์ www.jblthailand.com   และถือว่าท่านได้ให้ความตกลงในข้อตกลงและเงื่อนไขนี้ที่ได้มีการแก้ไขใหม่แล้วเมื่อท่านใช้บริการสั่งซื้อสินค้า บริษัทอาจทำการยกเลิกการให้บริการนี้ ณ เวลาใดๆ ก็ได้</p>
            <br />
            <p>3. การลงทะเบียนใช้บริการ และผู้ไม่มีสิทธิใช้บริการ</p>
            <p>ในการลงทะเบียนที่เว็บไซต์ www.jblthailand.com ท่านตกลงที่จะให้ข้อมูลรายละเอียดที่ถูกต้องตรงตามความเป็นจริง และหากมีการเปลี่ยนแปลงใดๆ เกี่ยวกับข้อมูลรายละเอียดที่ท่านได้ให้ไว้แก่บริษัท ท่านตกลงจะแจ้งให้บริษัททราบผ่านทางศูนย์บริการลูกค้าทางโทรศัพท์ที่หมายเลข 1516 (หรือหมายเลขอื่นใดที่ได้แจ้งในหน้าเว็บไซต์ www.jblthailand.com  ) หรือทำการแก้ไขข้อมูลผ่านทางหน้าเว็บไซต์โดยตรงทันที หากท่านประสงค์จะยกเลิกการลงทะเบียน ให้ท่านแจ้งไปยังศูนย์บริการลูกค้าทางโทรศัพท์ บริษัทมีสิทธิที่จะระงับหรือยกเลิกการลงทะเบียนของท่านได้หากบริษัทมีเหตุผลอันควรเชื่อได้ว่าท่านฝ่าฝืนข้อตกลงและเงื่อนไขนี้หรือข้อกำหนดและเงื่อนไขการสั่งซื้อสินค้าทางเว็บไซต์ ทั้งนี้ การยกเลิกการลงทะเบียนนี้จะไม่มีผลกระทบต่อข้อตกลงและเงื่อนไขนี้หรือข้อกำหนดและเงื่อนไขการสั่งซื้อสินค้าทางเว็บไซต์ซึ่งมีลักษณะเป็นการต่อเนื่องแต่ประการใด ในกรณีที่ท่านอยู่นอกพื้นที่บริการ บริษัทจะแจ้งให้ท่านทราบ ณ เวลาที่ท่านลงทะเบียนใช้บริการ และในกรณีดังกล่าว บริษัทสงวนสิทธิไม่ให้บริการแก่ท่าน </p>
            <br />
            <p>4. ความปลอดภัยเกี่ยวกับการใช้บริการของท่าน</p>
            <p>ระหว่างการลงทะเบียน บริษัทจะขอให้ท่านสร้างรหัสส่วนตัวสำหรับการเข้าถึงบัญชีของท่าน ซึ่งท่านจะต้องเก็บรหัสส่วนตัวดังกล่าวเป็นความลับไม่เปิดเผยให้ผู้ใดทราบ ท่านจะต้องเป็นผู้รับผิดชอบการดำเนินการใดๆ ที่กระทำผ่านทางบัญชีของท่าน หากท่านสงสัยว่ามีการใช้รหัสส่วนตัวของท่านโดยมิชอบหรือโดยไม่ได้รับอนุญาต ท่านตกลงจะแจ้งให้บริษัททราบผ่านทางศูนย์บริการลูกค้าทางโทรศัพท์โดยไม่ชักช้า หากบริษัทมีเหตุผลอันควรเชื่อได้ว่ามีหรืออาจจะมีการใช้บริการของบริษัทไปโดยมิชอบ บริษัทขอสงวนสิทธิ์ในการระงับใช้บัญชีของท่านหรือขอให้ท่านเปลี่ยนรหัสส่วนตัวของท่านได้ ทั้งนี้ บริษัทไม่จำเป็นต้องรับผิดชอบต่อความเสียหายใดๆ อันเนื่องมาจากการที่รหัสส่วนตัวของท่านถูกเปิดเผยหรือใช้ไปในทางมิชอบทั้งสิ้น </p>
            <br />
            <p>5. การปกป้องทรัพย์สินทางปัญญา</p>
            <p>บริษัทเป็นเจ้าของและผู้ดำเนินการเว็บไซต์ https://www.jblthailand.com และเป็นเจ้าของลิขสิทธิ์ในข้อความ รวมถึงภาพและการออกแบบหน้าเว็บเพจ ตลอดจนบรรดาภาพประกอบและข้อมูลเกี่ยวกับการบริการที่ปรากฏในหน้าเว็บเพจ ผู้เข้าชมเว็บไซต์ https://www.jblthailand.com ถือเป็นผู้ใช้เว็บไซต์ (ต่อไปนี้เรียกว่า "ผู้ใช้เว็บไซต์") และเมื่อมีการใช้งานเว็บไซต์นี้ ผู้ใช้เว็บไซต์มีหน้าที่ปฏิบัติตามกฎหมาย จรรยาบรรณที่ดี และข้อตกลงและเงื่อนไขนี้ ในการที่จะไม่ทำลายชื่อเสียงและทำให้เสื่อมซึ่งสิทธิของบริษัทหรือสิทธิของผู้ใช้เว็บไซต์รายอื่น ทั้งนี้ ผู้ใช้เว็บไซต์ตกลงที่จะไม่กระทำการใดๆ ตามที่ระบุดังต่อไปนี้</p>
            <p>• ใช้เว็บไซต์ไม่ว่าทั้งหมดหรือบางส่วนเพื่อวัตถุประสงค์อื่นนอกจากเพื่อการใช้งานของตน ซึ่งหมายถึงผู้ใช้เว็บไซต์จะต้องไม่ทำการคัดลอก ดาวน์โหลด หรือแจกจ่ายข้อความในเว็บไซต์ มากกว่าที่จำเป็นเพื่อการใช้งานของตน</p>
            <p>• กระทำการใดๆ ที่เป็นการรบกวนหรือแทรกแซงการใช้งานเว็บไซต์ของผู้ใช้เว็บไซต์รายอื่น หรือการกระทำการไม่ว่าในทางใดอันเป็นการขัดขวางผู้ใช้เว็บไซต์รายอื่น</p>
            <p>• กระทำการในทางใดๆ ที่กระทบต่อข้อความหรือลักษณะทางเทคนิคของเว็บไซต์โดยไม่ได้รับอนุมัติจากบริษัท</p>
            <p>• กระทำการอันกระทบต่อความปลอดภัยของเว็บไซต์</p>
            <p>• ใช้เว็บไซต์ในการแจกจ่ายข้อความที่ไม่ได้รับการร้องขอ (สแปม) หรือข้อความลูกโซ่ หรือส่งไวรัสหรือโปรแกรมใดๆ ที่เป็นอันตรายต่อเว็บไซต์</p>
            <p>• ส่งข้อความใดๆ ที่มีไวรัสหรือโปรแกรมที่เป็นอันตรายไปยังเว็บไซต์ • สร้างข้อความปลอมเพื่อบิดเบือนการแสดงตัวตนของผู้ใช้เว็บไซต์หรือพยายามเข้าไปยังบัญชีของผู้ใช้เว็บไซต์</p>
            <br />
            <p>6. การใช้บริการโดยไม่ได้รับอนุญาต</p>
            <p>ห้ามมิให้มีการใช้บริการโดยไม่ได้รับอนุญาต ซึ่งได้แก่</p>
            <p>• การแจกจ่ายข้อความที่เป็นการรบกวน ทำให้เสื่อมเสียชื่อเสียง ขัดกับหลักการเคารพสิทธิมนุษยชน เป็นการแบ่งแยกทางศาสนา ความเชื่อ เชื้อชาติ หรือเพศ ที่เป็นการกระตุ้นให้เกิดความรุนแรงหรือการกระทำที่ผิดกฎหมาย หรือการฝ่าฝืนกฎหมายในท้องที่ใดๆ</p>
            <p>• การแจกจ่ายข้อความที่เป็นการคุกคามความสงบเรียบร้อยของประชาชนหรือผลประโยชน์ตามกฎหมายของลูกค้า ผู้ใช้เว็บไซต์ บริษัท หรือบริษัทอื่นในเครือ มหาจักร</p>
            <p>• การเข้าถึงระบบคอมพิวเตอร์ของผู้อื่นโดยไม่ได้รับอนุญาต</p>
            <p>• การกีดกันมิให้ลูกค้าสามารถเข้าใช้บริการได้</p>
            <p>• การละเมิดสิทธิเกี่ยวกับการใช้เครือข่ายในการสื่อสารทางระบบอิเล็คทรอนิกส์สาธารณะ</p>
            <p>• การขัดขวางหรือทำให้เครือข่ายหรือเว็บไซต์ที่เชื่อมต่อกับเว็บไซต์ https://www.jblthailand.com หยุดชะงัก</p>
            <p>• การสร้าง การแจกจ่าย หรือการเก็บสำเนาเอกสารอิเล็คทรอนิกส์และเอกสารอื่นที่ได้รับความคุ้มครองภายใต้กฎหมายลิขสิทธิ์โดยไม่ได้รับอนุญาตล่วงหน้าจาก</p>
            <p>เจ้าของลิขสิทธิ์ บริษัทมีสิทธิที่จะตัดข้อความใดๆ ที่เป็นอันตรายออกจากเว็บไซต์ และมีสิทธิเรียกให้ผู้ใช้เว็บไซต์ผู้ก่อให้เกิดความเสียหายต่อบริษัทโดยการใช้บริการโดยไม่ได้รับอนุญาตให้ชำระค่าเสียหายเต็มจำนวนได้ ความเสียหายนี้ให้รวมถึงความเสียหายที่เกิดแก่บริษัท หรือความเสียหายที่บุคคลภายนอกเรียกร้องจากบริษัทอันเป็นผลสืบเนื่องมาจากการใช้เว็บไซต์โดยไม่ได้รับอนุญาตของผู้ใช้เว็บไซต์ ทั้งนี้ ความเสียหายหมายถึงทั้งความเสียหายโดยตรงและค่าใช้จ่ายที่จำเป็นในการใช้สิทธิเรียกค่าชดเชย และการแก้ไขสภาพที่บกพร่องที่มีสาเหตุมาจากการใช้บริการที่ไม่ได้รับอนุญาต และให้ถือว่าค่าปรับเป็นตัวเงินที่พนักงานเจ้าหน้าที่เรียกเก็บจากบริษัทจากการละเมิดข้อกำหนดของกฎหมายอันเนื่องจากการที่ผู้ใช้เว็บไซต์ใช้เว็บไซต์โดยไม่ได้รับอนุญาต เป็นความเสียหายด้วย</p>
            <br />
            <p>7. การใช้บริการ</p>
            <p>บริษัทพยายามอย่างที่สุดในการพัฒนาคุณภาพของการบริการ อย่างไรก็ดี เนื่องด้วยลักษณะทางเทคนิคของการให้บริการ บริษัทไม่สามารถรับประกันได้ว่าท่านจะสามารถใช้บริการได้อย่างสมบูรณ์หรือโดยปราศจากซึ่งปัญหาใดๆ แต่หากท่านพบความผิดพลาดทางเทคนิค ท่านสามารถรายงานความบกพร่องผ่านทางศูนย์บริการลูกค้าทางโทรศัพท์ได้ และบริษัทจะพยายามแก้ไขข้อบกพร่องอย่างรวดเร็วที่สุดเท่าที่จะทำได้ บริษัทสงวนสิทธิ์ที่จะมิให้ผู้ใช้เว็บไซต์เข้าถึงเว็บไซต์ https://www.jblthailand.com ได้หากมีความจำเป็นในการซ่อมแซมหรือบำรุงรักษา หรือปรับปรุงระบบ หรือเพื่อการนำระบบใหม่ๆ มาใช้ บริษัทมีความพยายามเป็นอย่างยิ่งในการจัดให้มีการบริการได้มากที่สุดเท่าที่จะเป็นไปได้และทำการขยายการให้บริการออกไปสู่พื้นที่อื่นๆ ในประเทศไทย ซึ่งท่านจะได้รับข้อมูลเกี่ยวกับการให้บริการในระหว่างขั้นตอนการทำรายการสั่งซื้อผ่านการบริการทางเว็บไซต์</p>
            <br />
            <p>8. ความรับผิด</p>
            <p>แม้ว่าบริษัทจะใช้ความพยายามในการตรวจสอบความถูกต้องแท้จริงและความเกี่ยวโยงระหว่างข้อความในเว็บไซต์ https://www.jblthailand.com ก็ตาม บริษัทก็ไม่สามารถรับประกันในเรื่องดังกล่าวแก่ผู้ใช้เว็บไซต์ได้ ด้วยเหตุนี้ บริษัทจึงไม่ขอรับประกันและไม่ขอรับผิดในความผิดพลาด การละเว้น หรือปัญหาทางเทคนิค ที่อาจเกิดขึ้นในระหว่างการใช้เว็บไซต์ หากบริษัทพบว่าข้อความใดไม่ถูกต้องและมีความเป็นไปได้ในทางเทคนิคและไม่เป็นการก่อให้เกิดค่าใช้จ่ายอันไม่สมเหตุสมผลแก่บริษัทในการที่จะแก้ไข บริษัทจะทำการปรับปรุงข้อความโดยเร็วที่สุดเท่าที่จะทำได้ ทั้งนี้ บริษัทไม่ขอรับผิดในส่วนต่อไปนี้</p>
            <p>• ข้อความในเว็บไซต์ซึ่งเป็นของบุคคลภายนอกที่สามารถเข้าถึงได้ผ่านทางเว็บไซต์ https://www.jblthailand.com หรือผ่านทางเว็บไซต์ของบุคคลภายนอกที่ระบุในเว็บไซต์ https://www.jblthailand.com หรือการโฆษณาหรือการส่งเสริมการขายใดๆ ของบุคคลภายนอกผ่านทางเว็บไซต์ของบริการนี้</p>
            <p>• ข้อความที่ระบุในเว็บไซต์ของการบริการนี้โดยไม่ได้รับความยินยอมหรือการรับทราบจากบริษัทและโดยทางเทคนิคบริษัทไม่สามารถป้องกันการใช้งานได้</p>
            <p>• การที่ไม่สามารถใช้เว็บไซต์ https://www.jblthailand.com ได้กับเครื่องมือและซอฟท์แวร์ของท่าน หรือการเชื่อมต่อเครือข่ายการสื่อสารทางอิเล็คทรอนิกส์ของท่าน</p>
            <p>• ปัญหาทางเทคนิค รวมถึงความผิดพลาดและล้มเหลวในการเชื่อมต่อกับเว็บไซต์ https://www.jblthailand.com ทั้งนี้ ข้อกำหนดในข้อนี้ไม่กระทบกับความรับผิดของบริษัทเกี่ยวกับข้อบกพร่องในผลิตภัณฑ์ที่ท่านได้ซื้อผ่านทางบริการนี้ในส่วนที่เกี่ยวกับข้อกำหนดของกฎหมายทั่วไป</p>
            <br />
            <p>9. การป้องกันข้อมูลส่วนบุคคลและความยินยอมในการดำเนินการกับข้อมูล</p>
            <p>บริษัทจะเก็บข้อมูลส่วนบุคคลของท่านเป็นความลับ ทั้งนี้ ท่านได้ให้ความยินยอมแก่บริษัทในการดำเนินการกับข้อมูลส่วนบุคคลของท่านที่ได้ให้ไว้แก่บริษัทเพื่อการดำเนินการดังต่อไปนี้</p>
            <p>(1) การให้บริการ โด  ยเฉพาะการรับคำสั่งซื้อ ดำเนินการเกี่ยวกับคำสั่งซื้อ และส่งสินค้าไปยังจุดหมายปลายทางที่ท่านกำหนด การชำระเงิน การออกใบเสร็จค่าสินค้า การสื่อสารกับท่านเกี่ยวกับคำสั่งซื้อ</p>
            <p>(2) (การให้ข้อมูลแก่ท่านเกี่ยวกับสินค้า บริการ และส่วนลด ของบริษัท (โดยเฉพาะทางอีเมลล์ โทรศัพท์ เอสเอ็มเอส (SMS) หรือเอ็มเอ็มเอส (MMS) หรือ Line@)) ท่านตกลงให้ความยินยอมแก่บริษัทในการจัดการข้อมูลที่ท่านได้ให้ไว้ในระหว่างการลงทะเบียนใช้บริการ หากท่านใช้บริการผ่านทางศูนย์บริการลูกค้าทางโทรศัพท์ บริษัทมีสิทธิบันทึกเสียงเพื่อประโยชน์ในการประเมินและพัฒนาคุณภาพของการให้บริการของบริษัท บริษัทขอแจ้งว่าบริษัทจะดำเนินการกับข้อมูลของท่าน เฉพาะที่เกี่ยวข้องกับวัตถุประสงค์ที่ท่านได้ให้ความยินยอมไว้แล้วเท่านั้น ท่านตกลงว่าได้ให้ข้อมูลของท่านในการสมัครใช้บริการผ่านเว็บไซต์หรือศูนย์บริการลูกค้าทางโทรศัพท์ด้วยความสมัครใจ กลับขึ้นด้านบน</p>
            <br />
            <p>10.ข้อกำหนดอื่นๆ</p>
            <p>ข้อตกลงและเงื่อนไขนี้ รวมถึงความตกลงใดๆ อันเกี่ยวเนื่องกับการใช้บริการ ให้อยู่ในบังคับของกฎหมายไทย การระงับข้อพิพาทให้กระทำในศาลไทยตามภูมิลำเนาของบริษัท ในกรณีที่ข้อความในข้อตกลงและเงื่อนไขนี้ในภาษาไทยและภาษาอังกฤษไม่ตรงกัน ให้ถือตามข้อความในเว็บไซต์ https://www.jblthailand.com ในภาษาไทยเป็นหลัก หากส่วนหนึ่งส่วนใดในข้อตกลงและเงื่อนไขนี้ไม่เหมาะสมหรือไม่มีผลบังคับใช้ตามกฎหมาย ให้ข้อกำหนดในส่วนดังกล่าวสิ้นผล และให้ข้อตกลงและเงื่อนไขนี้ในส่วนอื่นมีผลใช้บังคับต่อไป ในกรณีที่มีการฝ่าฝืนข้อตกลงและเงื่อนไขนี้ ไม่ว่าครั้งเดียวหรือเป็นการฝ่าฝืนซ้ำเดิมก็ตาม แต่บริษัทไม่ได้ใช้สิทธิที่มีเกี่ยวกับการฝ่าฝืนดังกล่าว ไม่ให้ถือว่าบริษัทสละสิทธิและไม่เป็นการกระทบสิทธิของบริษัทในการใช้สิทธิในภายหลัง หากบริษัทยกเว้นการฝ่าฝืนส่วนหนึ่งส่วนใดของข้อตกลงและเงื่อนไขนี้ ไม่ถือว่าเป็นการยกเว้นการฝ่าฝืนใดๆ ในอนาคตหรือการฝ่าฝืนข้อกำหนดอื่นๆ ที่ระบุไว้ในข้อตกลงและเงื่อนไขนี้แต่ประการใด บริษัทไม่มีส่วนรับผิดชอบในการฝ่าฝืนข้อตกลงและเงื่อนไขนี้หรือเงื่อนไขการสั่งซื้อสินค้าทางเว็บไซต์อันเนื่องมาจากเหตุการณ์ใดๆ ที่อยู่นอกเหนือความรับผิดชอบของบริษัท</p>
        </div>
    </>
  )
}
